---

<h1 align=left><font size = 8, style="color:rgb(200,0,0)"><b>Bibliotecas: <br>
- Pandas
</b></font></h1>

---

Click aqui e saiba mais ==> [Pandas](https://pandas.pydata.org/)

# Importamos a Biblioteca: Pandas

- Importamos a biblioteca

In [ ]:
import pandas as pd

> Em seguida iremos criar algumas listas que irão compor nosso dataframe

## Criando um dataframe

In [ ]:
# lista com Strings
nomes  = [ 'rafael', 'joao', 'rafael', 'maria']

# lista com interios --> int
idades = [ 23, 23, 34 ,21]

# lista com decimais -->
salario:[1.1, 2.3, 3.1, 4,4]


# lista com Strings
sexo   = ('M', 'M', 'F', 'O')


# Criando o dicionario
cadastro = {'nome':['rafael', 'joao', 'rafael', 'maria'],
                    'nota':[10, 9, 8,7 ],
                   'idade':[23, 23, 34 ,21],
                   'salario':[1,2,3,4]}
# imprimindo o dicionario
cadastro

{'nome': ['rafael', 'joao', 'rafael', 'maria'],
 'nota': [10, 9, 8, 7],
 'idade': [23, 23, 34, 21],
 'salario': [1, 2, 3, 4]}

In [ ]:
df = pd.DataFrame( cadastro )

## Imprimir o dataframe

In [ ]:
df

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

In [ ]:
print(df)

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

## Resgatando um valor de alguma das colunas

In [ ]:
df.nome[2]

'rafael'

- Obter os 3 primeiros valores da coluna nomes

In [ ]:
df.nome[:3]

0    rafael
1      joao
2    rafael
Name: nome, dtype: object

In [ ]:
df['nome']

0    rafael
1      joao
2    rafael
3     maria
Name: nome, dtype: object

## Agregando valores ao dataframe

In [ ]:

df1 = df.set_index('nome')

df1.groupby('nome').agg({'nota':'count',
                           'idade':'sum',
                           'salario':'mean'})

        nota  idade  salario
nome
joao       1     23      2.0
maria      1     21      4.0
rafael     2     57      2.0

In [ ]:
df1.idade['rafael']

nome
rafael    23
rafael    34
Name: idade, dtype: int64

# **`loc` e `iloc` - Resgatar valores do dataframe**

## loc
> Este método é primariamente baseado nas `labels da colunas`, porém podemos utilizar com um array booleano também.


> `df.loc[ <linhas>, <colunas>]`

In [ ]:
df.loc[2, 'nome']

'rafael'

In [ ]:
df1.loc['rafael', 'idade']

nome
rafael    23
rafael    34
Name: idade, dtype: int64

## iloc

> O indexador iloc é um tanto mais simples, ele seleciona por `números inteiros` das linhas, arrays ou por slice.

> `df.iloc[<linhas>, <colunas>]`

In [ ]:
df.iloc[2, 0] # obtemos

'rafael'

- Calculando a média das nota

# Agrupamento dos dados -- _GROUPBY_
**[groupby](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)**

- Agrupar pelo nome e obter a média

In [ ]:
df.groupby('nome').mean()

        nota  idade  salario
nome
joao     9.0   23.0      2.0
maria    7.0   21.0      4.0
rafael   9.0   28.5      2.0

- Contando o número de nomes

In [ ]:
df.groupby('nome').count()

        nota  idade  salario
nome
joao       1      1        1
maria      1      1        1
rafael     2      2        2

- Obter o valor (nota) de um especifico dado

In [ ]:
df.nota[df.nome=='rafael']

0    10
2     8
Name: nota, dtype: int64

- obtendo número de observações por grupo

In [ ]:
df.groupby('nome').size()

nome
joao      1
maria     1
rafael    2
dtype: int64

- Número de grupos

In [ ]:
df.groupby('nome').ngroups

3

> **8 coisas que você não sabia sobre o Pandas groupby**

click aqui ==> [Click](https://medium.com/data-hackers/8-coisas-que-voc%C3%AA-n%C3%A3o-sabia-sobre-o-pandas-groupby-b2c9033d7034)

# Exportando a bases de dados para .csv ou .xlsx

- caso deseje exportar o dataframe sem o index use este comando

> df.to_csv('file_name.csv', index=False)

- Se vc quer exportar com index pode utilizar o seguinte comando

> df.to_excel(r'Path where the exported excel will be stored\File Name.xlsx', index=False)

> df.to_csv('file_name.csv'.csv')

- Utilizaremos a última versão e exportaremos em formato `.csv` por já conter os indexes como foi feito nas práticas anteriores, e identificamos este arquivo com o nome de `'vendas_estudo.csv'`

> **Importante**, ainda que exporte com a coluna de index é preciso quando for importar essa base de dados, definir ou assignar os indexes novamente.

## Salvando o dataframe em um novo arquivo `.csv`

- para criar uma nova pasta chamada de `Results` e armazenar os nossos `arquivos` ou `dataframes` que contém os dados resultantes, utilizamos o seguinte codigo

In [ ]:
# df.to_csv('Aula_pandas_1.csv')

## Copia de dataframe

In [ ]:
import numpy as np

In [ ]:
df2 = np.array(df)
df2

array([['rafael', 10, 23, 1],
       ['joao', 9, 23, 2],
       ['rafael', 8, 34, 3],
       ['maria', 7, 21, 4]], dtype=object)

> **Nota** <br>Cuidado com a copia das tabelas, pois a copia simples influencia nas derivadas, melhor usar a função 'copy'... veja o que acontece com o simples copiar dados

In [ ]:
df3 = df
df3

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

- Vamos modificar a tabela original (df3)

In [ ]:
df3.loc[0,'nota']  = 10
df3

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

> Agora se olharmos a tabela original vemos que são identicas após a modificação da tabela 3

In [ ]:
df

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

- Então para que isso não aconteça utilizaremos a função "copy"

In [ ]:
import copy

In [ ]:
df3 = copy.deepcopy( df )
df3

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

- Testando novamente

In [ ]:
#modificamos a nossa 'tabela 3' que é uma copia da nossa 'tabela'

df3.loc[0, 'nota'] = 6
df3

     nome  nota  idade  salario
0  rafael     6     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

- E conferimos se foi modificada a nossa tabela original 'tabela'

In [ ]:
df

     nome  nota  idade  salario
0  rafael    10     23        1
1    joao     9     23        2
2  rafael     8     34        3
3   maria     7     21        4

> Otimo!!!

## Pandas: Leitura de DataFrame

- Importando desde um servidor

.... Importaremos os dados do arquivo `Aula_dados.xlsx` desde o servidor GITHUB  para serem usados diretamente aqui sem precisar baixalos

[Click aqui para baixar o arquivo `Aula_dados.xlsx`](https://github.com/tuliofor/Aulas_analiseExploratoriaDados/raw/main/Aula_dados.xlsx)

- Lendo os dados desde um arquivo de excel [.xlsx, .csv]

In [ ]:
import pandas as pd

In [ ]:
# utiizando os dados hospedado no GitHUb
address = 'https://github.com/tuliofor/dados_aula/raw/main/Aula_dados.xlsx'

In [ ]:
dados_pessoas = pd.read_excel(address, sheet_name='pessoas')
dados_notas = pd.read_excel(address, sheet_name='notas')

- imprimindo os dados do dataframe `pessoas`

In [ ]:
dados_pessoas

     nome  idade
0  rafael     15
1    joao     10
2   maria     18
3  mateus     12
4   pedro     11
5     ana     19

- Imprimindo os dados do dataframe `NOTAS`

In [ ]:
dados_notas

      nome  semestre  nota
0   rafael         1     7
1     joao         1     4
2    maria         1     9
3   mateus         1     8
4    pedro         1     7
5      ana         1    10
6   rafael         2    10
7     joao         2     8
8    maria         2     6
9   mateus         2     9
10   pedro         2     8
11     ana         2     6

- Agora podemos juntar os dois dataframes (notas e pessoas)

In [ ]:
dados_todos = dados_notas.set_index('nome').join(dados_pessoas.set_index('nome'))
dados_todos

        semestre  nota  idade
nome
ana            1    10     19
ana            2     6     19
joao           1     4     10
joao           2     8     10
maria          1     9     18
maria          2     6     18
mateus         1     8     12
mateus         2     9     12
pedro          1     7     11
pedro          2     8     11
rafael         1     7     15
rafael         2    10     15

- Exibindo através de Boleanos uma condição

In [ ]:
dados_todos['nota']== 10

nome
ana        True
ana       False
joao      False
joao      False
maria     False
maria     False
mateus    False
mateus    False
pedro     False
pedro     False
rafael    False
rafael     True
Name: nota, dtype: bool

- Utilizando a função `groupby` agrupar os dados e calcular a média

In [ ]:
medias_idades = dados_todos.groupby('nome').idade.mean()
medias_idades

nome
ana       19.0
joao      10.0
maria     18.0
mateus    12.0
pedro     11.0
rafael    15.0
Name: idade, dtype: float64

- Calculando a máxima de cada pessoa

In [ ]:
max_idades = dados_todos.groupby('nome').idade.max()
max_idades

nome
ana       19
joao      10
maria     18
mateus    12
pedro     11
rafael    15
Name: idade, dtype: int64

- Para importar o dataframe `medias_idades` usamos o seguinte código

In [ ]:
# medias_idades.to_excel(nome_do_arquivo + extensão)